tcv-git/goodmicro/lib/goodmicro_stm32f4/stm32f4xx_missing.h
// stm32f4xx_missing.h
// PUBLIC DOMAIN
// https://www.purposeful.co.uk/goodmicro/

/*
  I, Tom Vajzovic, am the author of this software and its documentation.
  I permanently abandon all intellectual property rights in them, including
  copyright, trademarks, design rights, database right, patents, and the right
  to be identified as the author.

  I am fairly certain that the software does what the documentation says it
  does, but I do not guarantee that it does, or that it does what you think it
  should.  I do not guarantee that it will not have undesirable side effects.

  You are free to use, modify and distribute this software as you please, but
  you do so at your own risk.  If you do not pass on this warning then you may
  be responsible for any problems encountered by those who obtain the software
  through you.
*/

/* constants that should have been in stm32f4xx.h */

#ifndef STM32F4XX_MISSING_H_INCLUDED
#define STM32F4XX_MISSING_H_INCLUDED

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

// #############################################################################
//
//      check part number macro
//
// #############################################################################

/* oldest */
#ifdef STM32F4XX
#error replace definition of STM32F4XX with eg: STM32F405xx
#endif

/* older */
#ifdef STM32F40XX
#error replace definition of STM32F40XX with STM32F405xx, STM32F415xx, STM32F407xx, or STM32F417xx
#endif

#ifdef STM32F427X
#error replace definition of STM32F427X with either STM32F427xx or STM32F437xx
#endif

/* old */
#ifdef STM32F40_41xxx
#error replace definition of STM32F40_41xxx with STM32F405xx, STM32F415xx, STM32F407xx, or STM32F417xx
#endif

#ifdef STM32F427_437xx
#error replace definition of STM32F427_437xx with either STM32F427xx or STM32F437xx
#endif

#ifdef STM32F429_439xx
#error replace definition of STM32F429_439xx with either STM32F429xx or STM32F439xx
#endif

#ifdef STM32F401xx
#error replace definition of STM32F401xx with either STM32F401xC or STM32F401xE
#endif


// #############################################################################
//
//      Device electronic signature
//
// #############################################################################

typedef struct
{
  uint32_t UDIDR[3];    /*!< Unique device ID register */
  uint16_t RESERVED[3];
  uint16_t FSIZER;      /*!< Flash size register       */
} DES_TypeDef;

#define DES_BASE                                0x1FFF7A10u
#define DES                                     ((const DES_TypeDef*)DES_BASE)


// #############################################################################
//
//      RCC parameter constants
//
// #############################################################################

#define HSI_VALUE                               16000000u

#define USBCLK_MAX                              48000000u

#define RCC_PLLM_MIN_VALUE                             2u
#define RCC_PLLM_MAX_VALUE                            63u
#define RCC_PLLQ_MIN_VALUE                             2u
#define RCC_PLLQ_MAX_VALUE                            15u


// #############################################################################
//
//      RCC register values
//
// #############################################################################

#define RCC_CR_HSEBYP_DISABLE                   (0u << RCC_CR_HSEBYP_Pos)
#define RCC_CR_HSEBYP_ENABLE                    (1u << RCC_CR_HSEBYP_Pos)

#define RCC_CFGR_MCO1_HSI                       (0u << RCC_CFGR_MCO1_Pos)
#define RCC_CFGR_MCO1_LSE                       (1u << RCC_CFGR_MCO1_Pos)
#define RCC_CFGR_MCO1_HSE                       (2u << RCC_CFGR_MCO1_Pos)
#define RCC_CFGR_MCO1_PLL                       (3u << RCC_CFGR_MCO1_Pos)
#define RCC_CFGR_MCO2_SYSCLK                    (0u << RCC_CFGR_MCO2_Pos)
#define RCC_CFGR_MCO2_PLLI2S                    (1u << RCC_CFGR_MCO2_Pos)
#define RCC_CFGR_MCO2_HSE                       (2u << RCC_CFGR_MCO2_Pos)
#define RCC_CFGR_MCO2_PLL                       (3u << RCC_CFGR_MCO2_Pos)

#define RCC_CFGR_MCO1PRE_DIV1                   (0u << RCC_CFGR_MCO1PRE_Pos)
#define RCC_CFGR_MCO1PRE_DIV2                   (4u << RCC_CFGR_MCO1PRE_Pos)
#define RCC_CFGR_MCO1PRE_DIV3                   (5u << RCC_CFGR_MCO1PRE_Pos)
#define RCC_CFGR_MCO1PRE_DIV4                   (6u << RCC_CFGR_MCO1PRE_Pos)
#define RCC_CFGR_MCO1PRE_DIV5                   (7u << RCC_CFGR_MCO1PRE_Pos)
#define RCC_CFGR_MCO2PRE_DIV1                   (0u << RCC_CFGR_MCO2PRE_Pos)
#define RCC_CFGR_MCO2PRE_DIV2                   (4u << RCC_CFGR_MCO2PRE_Pos)
#define RCC_CFGR_MCO2PRE_DIV3                   (5u << RCC_CFGR_MCO2PRE_Pos)
#define RCC_CFGR_MCO2PRE_DIV4                   (6u << RCC_CFGR_MCO2PRE_Pos)
#define RCC_CFGR_MCO2PRE_DIV5                   (7u << RCC_CFGR_MCO2PRE_Pos)

#ifdef RCC_DCKCFGR_PLLSAIDIVR_Pos
#define RCC_DCKCFGR_PLLSAIDIVR_DIV2             (0u << RCC_DCKCFGR_PLLSAIDIVR_Pos)
#define RCC_DCKCFGR_PLLSAIDIVR_DIV4             (1u << RCC_DCKCFGR_PLLSAIDIVR_Pos)
#define RCC_DCKCFGR_PLLSAIDIVR_DIV8             (2u << RCC_DCKCFGR_PLLSAIDIVR_Pos)
#define RCC_DCKCFGR_PLLSAIDIVR_DIV16            (3u << RCC_DCKCFGR_PLLSAIDIVR_Pos)
#endif


// #############################################################################
//
//      PWR register values
//
// #############################################################################

#if (defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || defined(STM32F417xx))
#define PWR_CR_VOS_SCALE2                       (0u << PWR_CR_VOS_Pos)  // low power
#define PWR_CR_VOS_SCALE1                       (1u << PWR_CR_VOS_Pos)  // high power, default
#endif

#if (defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx))
#define PWR_CR_VOS_SCALE3                       (1u << PWR_CR_VOS_Pos)  // low power
#define PWR_CR_VOS_SCALE2                       (2u << PWR_CR_VOS_Pos)
#define PWR_CR_VOS_SCALE1                       (3u << PWR_CR_VOS_Pos)  // high power, default
#endif

