tcv-git/goodmicro/lib/goodmicro_stm32f4/stm32f4xx_missing.h
#define PWR_CR_ODEN_DISABLE                     (0u << PWR_CR_ODEN_Pos)
#define PWR_CR_ODEN_ENABLE                      (1u << PWR_CR_ODEN_Pos)


// #############################################################################
//
//      SYSCFG register values
//
// #############################################################################

#define SYSCFG_CMPCR_CMP_PD_DISABLE             (0u << SYSCFG_CMPCR_CMP_PD_Pos)
#define SYSCFG_CMPCR_CMP_PD_ENABLE              (1u << SYSCFG_CMPCR_CMP_PD_Pos)


// #############################################################################
//
//      FLASH register values
//
// #############################################################################

#define FLASH_SR_OPERR                          FLASH_SR_SOP                             /*!< 0x00000002 */

#define FLASH_CR_ERRIE_Pos                      (25U)
#define FLASH_CR_ERRIE_Msk                      (0x1UL << FLASH_CR_ERRIE_Pos)            /*!< 0x02000000 */
#define FLASH_CR_ERRIE                          FLASH_CR_ERRIE_Msk

#define FLASH_CR_PSIZE_8BIT                     ( 0u << FLASH_CR_PSIZE_Pos)
#define FLASH_CR_PSIZE_16BIT                    ( 1u << FLASH_CR_PSIZE_Pos)
#define FLASH_CR_PSIZE_32BIT                    ( 2u << FLASH_CR_PSIZE_Pos)
#define FLASH_CR_PSIZE_64BIT                    ( 3u << FLASH_CR_PSIZE_Pos)


// #############################################################################
//
//      DMA register values
//
// #############################################################################

#define DMA_LIFCR_ALL0                          (DMA_LIFCR_CTCIF0 | DMA_LIFCR_CHTIF0 | DMA_LIFCR_CTEIF0 | DMA_LIFCR_CDMEIF0 | DMA_LIFCR_CFEIF0)
#define DMA_LIFCR_ALL1                          (DMA_LIFCR_CTCIF1 | DMA_LIFCR_CHTIF1 | DMA_LIFCR_CTEIF1 | DMA_LIFCR_CDMEIF1 | DMA_LIFCR_CFEIF1)
#define DMA_LIFCR_ALL2                          (DMA_LIFCR_CTCIF2 | DMA_LIFCR_CHTIF2 | DMA_LIFCR_CTEIF2 | DMA_LIFCR_CDMEIF2 | DMA_LIFCR_CFEIF2)
#define DMA_LIFCR_ALL3                          (DMA_LIFCR_CTCIF3 | DMA_LIFCR_CHTIF3 | DMA_LIFCR_CTEIF3 | DMA_LIFCR_CDMEIF3 | DMA_LIFCR_CFEIF3)
#define DMA_HIFCR_ALL4                          (DMA_HIFCR_CTCIF4 | DMA_HIFCR_CHTIF4 | DMA_HIFCR_CTEIF4 | DMA_HIFCR_CDMEIF4 | DMA_HIFCR_CFEIF4)
#define DMA_HIFCR_ALL5                          (DMA_HIFCR_CTCIF5 | DMA_HIFCR_CHTIF5 | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CFEIF5)
#define DMA_HIFCR_ALL6                          (DMA_HIFCR_CTCIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CFEIF6)
#define DMA_HIFCR_ALL7                          (DMA_HIFCR_CTCIF7 | DMA_HIFCR_CHTIF7 | DMA_HIFCR_CTEIF7 | DMA_HIFCR_CDMEIF7 | DMA_HIFCR_CFEIF7)

#define DMA_SxCR_CHSEL_CH0                      (0u << DMA_SxCR_CHSEL_Pos)
#define DMA_SxCR_CHSEL_CH1                      (1u << DMA_SxCR_CHSEL_Pos)
#define DMA_SxCR_CHSEL_CH2                      (2u << DMA_SxCR_CHSEL_Pos)
#define DMA_SxCR_CHSEL_CH3                      (3u << DMA_SxCR_CHSEL_Pos)
#define DMA_SxCR_CHSEL_CH4                      (4u << DMA_SxCR_CHSEL_Pos)
#define DMA_SxCR_CHSEL_CH5                      (5u << DMA_SxCR_CHSEL_Pos)
#define DMA_SxCR_CHSEL_CH6                      (6u << DMA_SxCR_CHSEL_Pos)
#define DMA_SxCR_CHSEL_CH7                      (7u << DMA_SxCR_CHSEL_Pos)

#define DMA1_S0CR_CHSEL_SPI3_RX                 DMA_SxCR_CHSEL_CH0
#define DMA1_S0CR_CHSEL_I2C1_RX                 DMA_SxCR_CHSEL_CH1
#define DMA1_S0CR_CHSEL_TIM4_CH1                DMA_SxCR_CHSEL_CH2
#define DMA1_S0CR_CHSEL_I2S3_EXT_RX             DMA_SxCR_CHSEL_CH3
#define DMA1_S0CR_CHSEL_UART5_RX                DMA_SxCR_CHSEL_CH4
#define DMA1_S0CR_CHSEL_UART8_TX                DMA_SxCR_CHSEL_CH5
#define DMA1_S0CR_CHSEL_TIM5_CH3_UP             DMA_SxCR_CHSEL_CH6
                     // NONE                    DMA_SxCR_CHSEL_CH7
                     // NONE                    DMA_SxCR_CHSEL_CH0
                     // NONE                    DMA_SxCR_CHSEL_CH1
                     // NONE                    DMA_SxCR_CHSEL_CH2
#define DMA1_S1CR_CHSEL_TIM2_UP_CH3             DMA_SxCR_CHSEL_CH3
#define DMA1_S1CR_CHSEL_USART3_RX               DMA_SxCR_CHSEL_CH4
#define DMA1_S1CR_CHSEL_UART7_TX                DMA_SxCR_CHSEL_CH5
#define DMA1_S1CR_CHSEL_TIM5_CH4_TRIG           DMA_SxCR_CHSEL_CH6
#define DMA1_S1CR_CHSEL_TIM6_UP                 DMA_SxCR_CHSEL_CH7
#define DMA1_S2CR_CHSEL_SPI3_RX                 DMA_SxCR_CHSEL_CH0
#define DMA1_S2CR_CHSEL_TIM7_UP                 DMA_SxCR_CHSEL_CH1
#define DMA1_S2CR_CHSEL_I2S3_EXT_RX             DMA_SxCR_CHSEL_CH2
#define DMA1_S2CR_CHSEL_I2C3_RX                 DMA_SxCR_CHSEL_CH3
#define DMA1_S2CR_CHSEL_UART4_RX                DMA_SxCR_CHSEL_CH4
#define DMA1_S2CR_CHSEL_TIM3_CH4_UP             DMA_SxCR_CHSEL_CH5
#define DMA1_S2CR_CHSEL_TIM5_CH1                DMA_SxCR_CHSEL_CH6
#define DMA1_S2CR_CHSEL_I2C2_RX                 DMA_SxCR_CHSEL_CH7
#define DMA1_S3CR_CHSEL_SPI2_RX                 DMA_SxCR_CHSEL_CH0
                     // NONE                    DMA_SxCR_CHSEL_CH1
#define DMA1_S3CR_CHSEL_TIM4_CH2                DMA_SxCR_CHSEL_CH2
#define DMA1_S3CR_CHSEL_I2S2_EXT_RX             DMA_SxCR_CHSEL_CH3
#define DMA1_S3CR_CHSEL_USART3_TX               DMA_SxCR_CHSEL_CH4
#define DMA1_S3CR_CHSEL_UART7_RX                DMA_SxCR_CHSEL_CH5
#define DMA1_S3CR_CHSEL_TIM5_CH4_TRIG           DMA_SxCR_CHSEL_CH6
#define DMA1_S3CR_CHSEL_I2C2_RX                 DMA_SxCR_CHSEL_CH7
#define DMA1_S4CR_CHSEL_SPI2_TX                 DMA_SxCR_CHSEL_CH0
#define DMA1_S4CR_CHSEL_TIM7_UP                 DMA_SxCR_CHSEL_CH1
#define DMA1_S4CR_CHSEL_I2S2_EXT_TX             DMA_SxCR_CHSEL_CH2
#define DMA1_S4CR_CHSEL_I2C3_TX                 DMA_SxCR_CHSEL_CH3
#define DMA1_S4CR_CHSEL_UART4_TX                DMA_SxCR_CHSEL_CH4
#define DMA1_S4CR_CHSEL_TIM3_CH1_TRIG           DMA_SxCR_CHSEL_CH5
#define DMA1_S4CR_CHSEL_TIM5_CH2                DMA_SxCR_CHSEL_CH6
#define DMA1_S4CR_CHSEL_USRART3_TX              DMA_SxCR_CHSEL_CH7
#define DMA1_S5CR_CHSEL_SPI3_TX                 DMA_SxCR_CHSEL_CH0
#define DMA1_S5CR_CHSEL_I2C1_RX                 DMA_SxCR_CHSEL_CH1
#define DMA1_S5CR_CHSEL_I2S3_EXT_TX             DMA_SxCR_CHSEL_CH2
#define DMA1_S5CR_CHSEL_TIM2_CH1                DMA_SxCR_CHSEL_CH3
#define DMA1_S5CR_CHSEL_USART2_RX               DMA_SxCR_CHSEL_CH4
#define DMA1_S5CR_CHSEL_TIM3_CH2                DMA_SxCR_CHSEL_CH5
                     // NONE                    DMA_SxCR_CHSEL_CH6
#define DMA1_S5CR_CHSEL_DAC1                    DMA_SxCR_CHSEL_CH7
                     // NONE                    DMA_SxCR_CHSEL_CH0
#define DMA1_S6CR_CHSEL_I2C1_TX                 DMA_SxCR_CHSEL_CH1
#define DMA1_S6CR_CHSEL_TIM4_UP                 DMA_SxCR_CHSEL_CH2
#define DMA1_S6CR_CHSEL_TIM2_CH2_CH4            DMA_SxCR_CHSEL_CH3
#define DMA1_S6CR_CHSEL_USART2_TX               DMA_SxCR_CHSEL_CH4
#define DMA1_S6CR_CHSEL_UART8_RX                DMA_SxCR_CHSEL_CH5
#define DMA1_S6CR_CHSEL_TIM5_UP                 DMA_SxCR_CHSEL_CH6
#define DMA1_S6CR_CHSEL_DAC2                    DMA_SxCR_CHSEL_CH7
#define DMA1_S7CR_CHSEL_SPI3_TX                 DMA_SxCR_CHSEL_CH0
#define DMA1_S7CR_CHSEL_I2C1_TX                 DMA_SxCR_CHSEL_CH1
#define DMA1_S7CR_CHSEL_TIM4_CH3                DMA_SxCR_CHSEL_CH2
#define DMA1_S7CR_CHSEL_TIM2_UP_CH4             DMA_SxCR_CHSEL_CH3
#define DMA1_S7CR_CHSEL_UART5_TX                DMA_SxCR_CHSEL_CH4
#define DMA1_S7CR_CHSEL_TIM3_CH3                DMA_SxCR_CHSEL_CH5
                     // NONE                    DMA_SxCR_CHSEL_CH6
#define DMA1_S7CR_CHSEL_I2C2_TX                 DMA_SxCR_CHSEL_CH7
#define DMA2_S0CR_CHSEL_ADC1                    DMA_SxCR_CHSEL_CH0
                     // NONE                    DMA_SxCR_CHSEL_CH1
#define DMA2_S0CR_CHSEL_ADC3                    DMA_SxCR_CHSEL_CH2
#define DMA2_S0CR_CHSEL_SPI1_RX                 DMA_SxCR_CHSEL_CH3
#define DMA2_S0CR_CHSEL_SPI4_RX                 DMA_SxCR_CHSEL_CH4
                     // NONE                    DMA_SxCR_CHSEL_CH5
#define DMA2_S0CR_CHSEL_TIM1_TRIG               DMA_SxCR_CHSEL_CH6
                     // NONE                    DMA_SxCR_CHSEL_CH7
#define DMA2_S1CR_CHSEL_SAI1_A                  DMA_SxCR_CHSEL_CH0
#define DMA2_S1CR_CHSEL_DCMI                    DMA_SxCR_CHSEL_CH1
#define DMA2_S1CR_CHSEL_ADC3                    DMA_SxCR_CHSEL_CH2
                     // NONE                    DMA_SxCR_CHSEL_CH3
#define DMA2_S1CR_CHSEL_SPI4_TX                 DMA_SxCR_CHSEL_CH4
#define DMA2_S1CR_CHSEL_USART6_RX               DMA_SxCR_CHSEL_CH5
#define DMA2_S1CR_CHSEL_TIM1_CH1                DMA_SxCR_CHSEL_CH6
#define DMA2_S1CR_CHSEL_TIM8_UP                 DMA_SxCR_CHSEL_CH7
#define DMA2_S2CR_CHSEL_TIM8_CH1_CH2_CH3        DMA_SxCR_CHSEL_CH0
#define DMA2_S2CR_CHSEL_ADC2                    DMA_SxCR_CHSEL_CH1
                     // NONE                    DMA_SxCR_CHSEL_CH2
#define DMA2_S2CR_CHSEL_SPI1_RX                 DMA_SxCR_CHSEL_CH3
#define DMA2_S2CR_CHSEL_USART1_RX               DMA_SxCR_CHSEL_CH4
#define DMA2_S2CR_CHSEL_USART6_RX               DMA_SxCR_CHSEL_CH5
#define DMA2_S2CR_CHSEL_TIM1_CH2                DMA_SxCR_CHSEL_CH6
#define DMA2_S2CR_CHSEL_TIM8_CH1                DMA_SxCR_CHSEL_CH7
#define DMA2_S3CR_CHSEL_SAI1_A                  DMA_SxCR_CHSEL_CH0
#define DMA2_S3CR_CHSEL_ADC2                    DMA_SxCR_CHSEL_CH1
#define DMA2_S3CR_CHSEL_SPI5_RX                 DMA_SxCR_CHSEL_CH2
#define DMA2_S3CR_CHSEL_SPI1_TX                 DMA_SxCR_CHSEL_CH3
#define DMA2_S3CR_CHSEL_SDIO                    DMA_SxCR_CHSEL_CH4
#define DMA2_S3CR_CHSEL_SPI4_RX                 DMA_SxCR_CHSEL_CH5
#define DMA2_S3CR_CHSEL_TIM1_CH1                DMA_SxCR_CHSEL_CH6
#define DMA2_S3CR_CHSEL_TIM8_CH2                DMA_SxCR_CHSEL_CH7
#define DMA2_S4CR_CHSEL_ADC1                    DMA_SxCR_CHSEL_CH0
#define DMA2_S4CR_CHSEL_SAI1_B                  DMA_SxCR_CHSEL_CH1
#define DMA2_S4CR_CHSEL_SPI5_TX                 DMA_SxCR_CHSEL_CH2
                     // NONE                    DMA_SxCR_CHSEL_CH3
                     // NONE                    DMA_SxCR_CHSEL_CH4
#define DMA2_S4CR_CHSEL_SPI4_TX                 DMA_SxCR_CHSEL_CH5
#define DMA2_S4CR_CHSEL_TIM1_CH4_TRIG_COM       DMA_SxCR_CHSEL_CH6
#define DMA2_S4CR_CHSEL_TIM8_CH3                DMA_SxCR_CHSEL_CH7
#define DMA2_S5CR_CHSEL_SAI1_B                  DMA_SxCR_CHSEL_CH0
#define DMA2_S5CR_CHSEL_SPI6_TX                 DMA_SxCR_CHSEL_CH1
#define DMA2_S5CR_CHSEL_CRYP_OUT                DMA_SxCR_CHSEL_CH2
#define DMA2_S5CR_CHSEL_SPI1_TX                 DMA_SxCR_CHSEL_CH3
#define DMA2_S5CR_CHSEL_USART1_RX               DMA_SxCR_CHSEL_CH4
                     // NONE                    DMA_SxCR_CHSEL_CH5
#define DMA2_S5CR_CHSEL_TIM1_UP                 DMA_SxCR_CHSEL_CH6
#define DMA2_S5CR_CHSEL_SPI5_RX                 DMA_SxCR_CHSEL_CH7
#define DMA2_S6CR_CHSEL_TIM1_CH1_CH2_CH3        DMA_SxCR_CHSEL_CH0
#define DMA2_S6CR_CHSEL_SPI6_RX                 DMA_SxCR_CHSEL_CH1
#define DMA2_S6CR_CHSEL_CRYP_IN                 DMA_SxCR_CHSEL_CH2
                     // NONE                    DMA_SxCR_CHSEL_CH3
#define DMA2_S6CR_CHSEL_SDIO                    DMA_SxCR_CHSEL_CH4
#define DMA2_S6CR_CHSEL_USART6_TX               DMA_SxCR_CHSEL_CH5
#define DMA2_S6CR_CHSEL_TIM1_CH3                DMA_SxCR_CHSEL_CH6
#define DMA2_S6CR_CHSEL_SPI5_TX                 DMA_SxCR_CHSEL_CH7
                     // NONE                    DMA_SxCR_CHSEL_CH0
#define DMA2_S7CR_CHSEL_DCMI                    DMA_SxCR_CHSEL_CH1
#define DMA2_S7CR_CHSEL_HASH_IN                 DMA_SxCR_CHSEL_CH2
                     // NONE                    DMA_SxCR_CHSEL_CH3
#define DMA2_S7CR_CHSEL_USART1_TX               DMA_SxCR_CHSEL_CH4
#define DMA2_S7CR_CHSEL_USART6_TX               DMA_SxCR_CHSEL_CH5
                     // NONE                    DMA_SxCR_CHSEL_CH6
#define DMA2_S7CR_CHSEL_TIM8_CH4_TRIG_COM       DMA_SxCR_CHSEL_CH7

#define DMA_SxCR_MBURST_SINGLE                  (0u << DMA_SxCR_MBURST_Pos)
#define DMA_SxCR_MBURST_INCR4                   (1u << DMA_SxCR_MBURST_Pos)
#define DMA_SxCR_MBURST_INCR8                   (2u << DMA_SxCR_MBURST_Pos)
#define DMA_SxCR_MBURST_INCR16                  (3u << DMA_SxCR_MBURST_Pos)
#define DMA_SxCR_PBURST_SINGLE                  (0u << DMA_SxCR_PBURST_Pos)
#define DMA_SxCR_PBURST_INCR4                   (1u << DMA_SxCR_PBURST_Pos)
#define DMA_SxCR_PBURST_INCR8                   (2u << DMA_SxCR_PBURST_Pos)
#define DMA_SxCR_PBURST_INCR16                  (3u << DMA_SxCR_PBURST_Pos)
#define DMA_SxCR_PL_LOW                         (0u << DMA_SxCR_PL_Pos)
#define DMA_SxCR_PL_MEDIUM                      (1u << DMA_SxCR_PL_Pos)
#define DMA_SxCR_PL_HIGH                        (2u << DMA_SxCR_PL_Pos)
#define DMA_SxCR_PL_VHIGH                       (3u << DMA_SxCR_PL_Pos)
#define DMA_SxCR_MSIZE_8BIT                     (0u << DMA_SxCR_MSIZE_Pos)
#define DMA_SxCR_MSIZE_16BIT                    (1u << DMA_SxCR_MSIZE_Pos)
#define DMA_SxCR_MSIZE_32BIT                    (2u << DMA_SxCR_MSIZE_Pos)
#define DMA_SxCR_PSIZE_8BIT                     (0u << DMA_SxCR_PSIZE_Pos)
#define DMA_SxCR_PSIZE_16BIT                    (1u << DMA_SxCR_PSIZE_Pos)
#define DMA_SxCR_PSIZE_32BIT                    (2u << DMA_SxCR_PSIZE_Pos)
#define DMA_SxCR_DIR_P2M                        (0u << DMA_SxCR_DIR_Pos)
#define DMA_SxCR_DIR_M2P                        (1u << DMA_SxCR_DIR_Pos)
#define DMA_SxCR_DIR_M2M                        (2u << DMA_SxCR_DIR_Pos)


// #############################################################################
//
//      SPI register values
//
// #############################################################################

#define SPI_CR1_BR_DIV2                         (0u << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_DIV4                         (1u << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_DIV8                         (2u << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_DIV16                        (3u << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_DIV32                        (4u << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_DIV64                        (5u << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_DIV128                       (6u << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_DIV256                       (7u << SPI_CR1_BR_Pos)


// #############################################################################
//
//      TIM register values
//
// #############################################################################

