tcv-git/goodmicro/lib/goodmicro_stm32f4/stm32f4xx_missing.h
#define TIM_CR2_MMS_RESET                       (0u << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_ENABLE                      (1u << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_UPDATE                      (2u << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_CC1                         (3u << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_OC1                         (4u << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_OC2                         (5u << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_OC3                         (6u << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_OC4                         (7u << TIM_CR2_MMS_Pos)

#define TIM_SMCR_TS_ITR0                        (0u << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_ITR1                        (1u << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_ITR2                        (2u << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_ITR3                        (3u << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_TI1F_ED                     (4u << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_TI1FP1                      (5u << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_TI2FP2                      (6u << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_ETRF                        (7u << TIM_SMCR_TS_Pos)
#define TIM_SMCR_SMS_DISABLED                   (0u << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_ENCODER_MODE1              (1u << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_ENCODER_MODE2              (2u << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_ENCODER_MODE3              (3u << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_RESET                      (4u << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_GATED                      (5u << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_TRIGGER                    (6u << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_ECLK_MODE1                 (7u << TIM_SMCR_SMS_Pos)

#define TIM1_SMCR_TS_TIM5                       TIM_SMCR_TS_ITR0
#define TIM1_SMCR_TS_TIM2                       TIM_SMCR_TS_ITR1
#define TIM1_SMCR_TS_TIM3                       TIM_SMCR_TS_ITR2
#define TIM1_SMCR_TS_TIM4                       TIM_SMCR_TS_ITR3
#define TIM8_SMCR_TS_TIM1                       TIM_SMCR_TS_ITR0
#define TIM8_SMCR_TS_TIM2                       TIM_SMCR_TS_ITR1
#define TIM8_SMCR_TS_TIM4                       TIM_SMCR_TS_ITR2
#define TIM8_SMCR_TS_TIM5                       TIM_SMCR_TS_ITR3
#define TIM2_SMCR_TS_TIM1                       TIM_SMCR_TS_ITR0
#define TIM2_SMCR_TS_TIM8                       TIM_SMCR_TS_ITR1
#define TIM2_SMCR_TS_TIM3                       TIM_SMCR_TS_ITR2
#define TIM2_SMCR_TS_TIM4                       TIM_SMCR_TS_ITR3
#define TIM3_SMCR_TS_TIM1                       TIM_SMCR_TS_ITR0
#define TIM3_SMCR_TS_TIM2                       TIM_SMCR_TS_ITR1
#define TIM3_SMCR_TS_TIM5                       TIM_SMCR_TS_ITR2
#define TIM3_SMCR_TS_TIM4                       TIM_SMCR_TS_ITR3
#define TIM4_SMCR_TS_TIM1                       TIM_SMCR_TS_ITR0
#define TIM4_SMCR_TS_TIM2                       TIM_SMCR_TS_ITR1
#define TIM4_SMCR_TS_TIM3                       TIM_SMCR_TS_ITR2
#define TIM4_SMCR_TS_TIM8                       TIM_SMCR_TS_ITR3
#define TIM5_SMCR_TS_TIM2                       TIM_SMCR_TS_ITR0
#define TIM5_SMCR_TS_TIM3                       TIM_SMCR_TS_ITR1
#define TIM5_SMCR_TS_TIM4                       TIM_SMCR_TS_ITR2
#define TIM5_SMCR_TS_TIM8                       TIM_SMCR_TS_ITR3

#define TIM_CCMR1_OC1M_FROZEN                   (0u << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC2M_FROZEN                   (0u << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR2_OC3M_FROZEN                   (0u << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC4M_FROZEN                   (0u << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR1_OC1M_MATCH_ACTIVE             (1u << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC2M_MATCH_ACTIVE             (1u << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR2_OC3M_MATCH_ACTIVE             (1u << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC4M_MATCH_ACTIVE             (1u << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR1_OC1M_MATCH_INACTIVE           (2u << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC2M_MATCH_INACTIVE           (2u << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR2_OC3M_MATCH_INACTIVE           (2u << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC4M_MATCH_INACTIVE           (2u << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR1_OC1M_MATCH_TOGGLE             (3u << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC2M_MATCH_TOGGLE             (3u << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR2_OC3M_MATCH_TOGGLE             (3u << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC4M_MATCH_TOGGLE             (3u << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR1_OC1M_FORCE_INACTIVE           (4u << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC2M_FORCE_INACTIVE           (4u << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR2_OC3M_FORCE_INACTIVE           (4u << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC4M_FORCE_INACTIVE           (4u << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR1_OC1M_FORCE_ACTIVE             (5u << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC2M_FORCE_ACTIVE             (5u << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR2_OC3M_FORCE_ACTIVE             (5u << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC4M_FORCE_ACTIVE             (5u << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR1_OC1M_PWM_MODE1                (6u << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC2M_PWM_MODE1                (6u << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR2_OC3M_PWM_MODE1                (6u << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC4M_PWM_MODE1                (6u << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR1_OC1M_PWM_MODE2                (7u << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC2M_PWM_MODE2                (7u << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR2_OC3M_PWM_MODE2                (7u << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC4M_PWM_MODE2                (7u << TIM_CCMR2_OC4M_Pos)

#define TIM_CCMR1_CC1S_OC1                      (0u << TIM_CCMR1_CC1S_Pos)
#define TIM_CCMR1_CC2S_OC2                      (0u << TIM_CCMR1_CC2S_Pos)
#define TIM_CCMR2_CC3S_OC3                      (0u << TIM_CCMR2_CC3S_Pos)
#define TIM_CCMR2_CC4S_OC4                      (0u << TIM_CCMR2_CC4S_Pos)
#define TIM_CCMR1_CC1S_TI1                      (1u << TIM_CCMR1_CC1S_Pos)
#define TIM_CCMR1_CC2S_TI2                      (1u << TIM_CCMR1_CC2S_Pos)
#define TIM_CCMR2_CC3S_TI3                      (1u << TIM_CCMR2_CC3S_Pos)
#define TIM_CCMR2_CC4S_TI4                      (1u << TIM_CCMR2_CC4S_Pos)
#define TIM_CCMR1_CC1S_TI2                      (2u << TIM_CCMR1_CC1S_Pos)
#define TIM_CCMR1_CC2S_TI1                      (2u << TIM_CCMR1_CC2S_Pos)
#define TIM_CCMR2_CC3S_TI4                      (2u << TIM_CCMR2_CC3S_Pos)
#define TIM_CCMR2_CC4S_TI3                      (2u << TIM_CCMR2_CC4S_Pos)
#define TIM_CCMR1_CC1S_TRC                      (3u << TIM_CCMR1_CC1S_Pos)
#define TIM_CCMR1_CC2S_TRC                      (3u << TIM_CCMR1_CC2S_Pos)
#define TIM_CCMR2_CC3S_TRC                      (3u << TIM_CCMR2_CC3S_Pos)
#define TIM_CCMR2_CC4S_TRC                      (3u << TIM_CCMR2_CC4S_Pos)

#define TIM1_SR_ALL                             (TIM_SR_CC4OF | TIM_SR_CC3OF | TIM_SR_CC2OF | TIM_SR_CC1OF | TIM_SR_BIF | TIM_SR_TIF | TIM_SR_COMIF | TIM_SR_UIF | TIM_SR_CC4IF | TIM_SR_CC3IF | TIM_SR_CC2IF | TIM_SR_CC1IF)
#define TIM3_SR_ALL                             (TIM_SR_CC4OF | TIM_SR_CC3OF | TIM_SR_CC2OF | TIM_SR_CC1OF | TIM_SR_TIF                             | TIM_SR_UIF | TIM_SR_CC4IF | TIM_SR_CC3IF | TIM_SR_CC2IF | TIM_SR_CC1IF)

#define TIM11_OR_TI1_RMP_HSE_RTC                2u


// #############################################################################
//
//      ADC register values
//
// #############################################################################

