tcv-git/goodmicro/lib/goodmicro_stm32f4/stm32f4xx_missing.h
#define ADC_SMPR2_SMP0_3_CYCLES                 ( 0u << ADC_SMPR2_SMP0_Pos)
#define ADC_SMPR2_SMP0_15_CYCLES                ( 1u << ADC_SMPR2_SMP0_Pos)
#define ADC_SMPR2_SMP0_28_CYCLES                ( 2u << ADC_SMPR2_SMP0_Pos)
#define ADC_SMPR2_SMP0_56_CYCLES                ( 3u << ADC_SMPR2_SMP0_Pos)
#define ADC_SMPR2_SMP0_84_CYCLES                ( 4u << ADC_SMPR2_SMP0_Pos)
#define ADC_SMPR2_SMP0_112_CYCLES               ( 5u << ADC_SMPR2_SMP0_Pos)
#define ADC_SMPR2_SMP0_144_CYCLES               ( 6u << ADC_SMPR2_SMP0_Pos)
#define ADC_SMPR2_SMP0_480_CYCLES               ( 7u << ADC_SMPR2_SMP0_Pos)
#define ADC_SMPR2_SMP1_3_CYCLES                 ( 0u << ADC_SMPR2_SMP1_Pos)
#define ADC_SMPR2_SMP1_15_CYCLES                ( 1u << ADC_SMPR2_SMP1_Pos)
#define ADC_SMPR2_SMP1_28_CYCLES                ( 2u << ADC_SMPR2_SMP1_Pos)
#define ADC_SMPR2_SMP1_56_CYCLES                ( 3u << ADC_SMPR2_SMP1_Pos)
#define ADC_SMPR2_SMP1_84_CYCLES                ( 4u << ADC_SMPR2_SMP1_Pos)
#define ADC_SMPR2_SMP1_112_CYCLES               ( 5u << ADC_SMPR2_SMP1_Pos)
#define ADC_SMPR2_SMP1_144_CYCLES               ( 6u << ADC_SMPR2_SMP1_Pos)
#define ADC_SMPR2_SMP1_480_CYCLES               ( 7u << ADC_SMPR2_SMP1_Pos)
#define ADC_SMPR2_SMP2_3_CYCLES                 ( 0u << ADC_SMPR2_SMP2_Pos)
#define ADC_SMPR2_SMP2_15_CYCLES                ( 1u << ADC_SMPR2_SMP2_Pos)
#define ADC_SMPR2_SMP2_28_CYCLES                ( 2u << ADC_SMPR2_SMP2_Pos)
#define ADC_SMPR2_SMP2_56_CYCLES                ( 3u << ADC_SMPR2_SMP2_Pos)
#define ADC_SMPR2_SMP2_84_CYCLES                ( 4u << ADC_SMPR2_SMP2_Pos)
#define ADC_SMPR2_SMP2_112_CYCLES               ( 5u << ADC_SMPR2_SMP2_Pos)
#define ADC_SMPR2_SMP2_144_CYCLES               ( 6u << ADC_SMPR2_SMP2_Pos)
#define ADC_SMPR2_SMP2_480_CYCLES               ( 7u << ADC_SMPR2_SMP2_Pos)
#define ADC_SMPR2_SMP3_3_CYCLES                 ( 0u << ADC_SMPR2_SMP3_Pos)
#define ADC_SMPR2_SMP3_15_CYCLES                ( 1u << ADC_SMPR2_SMP3_Pos)
#define ADC_SMPR2_SMP3_28_CYCLES                ( 2u << ADC_SMPR2_SMP3_Pos)
#define ADC_SMPR2_SMP3_56_CYCLES                ( 3u << ADC_SMPR2_SMP3_Pos)
#define ADC_SMPR2_SMP3_84_CYCLES                ( 4u << ADC_SMPR2_SMP3_Pos)
#define ADC_SMPR2_SMP3_112_CYCLES               ( 5u << ADC_SMPR2_SMP3_Pos)
#define ADC_SMPR2_SMP3_144_CYCLES               ( 6u << ADC_SMPR2_SMP3_Pos)
#define ADC_SMPR2_SMP3_480_CYCLES               ( 7u << ADC_SMPR2_SMP3_Pos)
#define ADC_SMPR2_SMP4_3_CYCLES                 ( 0u << ADC_SMPR2_SMP4_Pos)
#define ADC_SMPR2_SMP4_15_CYCLES                ( 1u << ADC_SMPR2_SMP4_Pos)
#define ADC_SMPR2_SMP4_28_CYCLES                ( 2u << ADC_SMPR2_SMP4_Pos)
#define ADC_SMPR2_SMP4_56_CYCLES                ( 3u << ADC_SMPR2_SMP4_Pos)
#define ADC_SMPR2_SMP4_84_CYCLES                ( 4u << ADC_SMPR2_SMP4_Pos)
#define ADC_SMPR2_SMP4_112_CYCLES               ( 5u << ADC_SMPR2_SMP4_Pos)
#define ADC_SMPR2_SMP4_144_CYCLES               ( 6u << ADC_SMPR2_SMP4_Pos)
#define ADC_SMPR2_SMP4_480_CYCLES               ( 7u << ADC_SMPR2_SMP4_Pos)
#define ADC_SMPR2_SMP5_3_CYCLES                 ( 0u << ADC_SMPR2_SMP5_Pos)
#define ADC_SMPR2_SMP5_15_CYCLES                ( 1u << ADC_SMPR2_SMP5_Pos)
#define ADC_SMPR2_SMP5_28_CYCLES                ( 2u << ADC_SMPR2_SMP5_Pos)
#define ADC_SMPR2_SMP5_56_CYCLES                ( 3u << ADC_SMPR2_SMP5_Pos)
#define ADC_SMPR2_SMP5_84_CYCLES                ( 4u << ADC_SMPR2_SMP5_Pos)
#define ADC_SMPR2_SMP5_112_CYCLES               ( 5u << ADC_SMPR2_SMP5_Pos)
#define ADC_SMPR2_SMP5_144_CYCLES               ( 6u << ADC_SMPR2_SMP5_Pos)
#define ADC_SMPR2_SMP5_480_CYCLES               ( 7u << ADC_SMPR2_SMP5_Pos)
#define ADC_SMPR2_SMP6_3_CYCLES                 ( 0u << ADC_SMPR2_SMP6_Pos)
#define ADC_SMPR2_SMP6_15_CYCLES                ( 1u << ADC_SMPR2_SMP6_Pos)
#define ADC_SMPR2_SMP6_28_CYCLES                ( 2u << ADC_SMPR2_SMP6_Pos)
#define ADC_SMPR2_SMP6_56_CYCLES                ( 3u << ADC_SMPR2_SMP6_Pos)
#define ADC_SMPR2_SMP6_84_CYCLES                ( 4u << ADC_SMPR2_SMP6_Pos)
#define ADC_SMPR2_SMP6_112_CYCLES               ( 5u << ADC_SMPR2_SMP6_Pos)
#define ADC_SMPR2_SMP6_144_CYCLES               ( 6u << ADC_SMPR2_SMP6_Pos)
#define ADC_SMPR2_SMP6_480_CYCLES               ( 7u << ADC_SMPR2_SMP6_Pos)
#define ADC_SMPR2_SMP7_3_CYCLES                 ( 0u << ADC_SMPR2_SMP7_Pos)
#define ADC_SMPR2_SMP7_15_CYCLES                ( 1u << ADC_SMPR2_SMP7_Pos)
#define ADC_SMPR2_SMP7_28_CYCLES                ( 2u << ADC_SMPR2_SMP7_Pos)
#define ADC_SMPR2_SMP7_56_CYCLES                ( 3u << ADC_SMPR2_SMP7_Pos)
#define ADC_SMPR2_SMP7_84_CYCLES                ( 4u << ADC_SMPR2_SMP7_Pos)
#define ADC_SMPR2_SMP7_112_CYCLES               ( 5u << ADC_SMPR2_SMP7_Pos)
#define ADC_SMPR2_SMP7_144_CYCLES               ( 6u << ADC_SMPR2_SMP7_Pos)
#define ADC_SMPR2_SMP7_480_CYCLES               ( 7u << ADC_SMPR2_SMP7_Pos)
#define ADC_SMPR2_SMP8_3_CYCLES                 ( 0u << ADC_SMPR2_SMP8_Pos)
#define ADC_SMPR2_SMP8_15_CYCLES                ( 1u << ADC_SMPR2_SMP8_Pos)
#define ADC_SMPR2_SMP8_28_CYCLES                ( 2u << ADC_SMPR2_SMP8_Pos)
#define ADC_SMPR2_SMP8_56_CYCLES                ( 3u << ADC_SMPR2_SMP8_Pos)
#define ADC_SMPR2_SMP8_84_CYCLES                ( 4u << ADC_SMPR2_SMP8_Pos)
#define ADC_SMPR2_SMP8_112_CYCLES               ( 5u << ADC_SMPR2_SMP8_Pos)
#define ADC_SMPR2_SMP8_144_CYCLES               ( 6u << ADC_SMPR2_SMP8_Pos)
#define ADC_SMPR2_SMP8_480_CYCLES               ( 7u << ADC_SMPR2_SMP8_Pos)
#define ADC_SMPR2_SMP9_3_CYCLES                 ( 0u << ADC_SMPR2_SMP9_Pos)
#define ADC_SMPR2_SMP9_15_CYCLES                ( 1u << ADC_SMPR2_SMP9_Pos)
#define ADC_SMPR2_SMP9_28_CYCLES                ( 2u << ADC_SMPR2_SMP9_Pos)
#define ADC_SMPR2_SMP9_56_CYCLES                ( 3u << ADC_SMPR2_SMP9_Pos)
#define ADC_SMPR2_SMP9_84_CYCLES                ( 4u << ADC_SMPR2_SMP9_Pos)
#define ADC_SMPR2_SMP9_112_CYCLES               ( 5u << ADC_SMPR2_SMP9_Pos)
#define ADC_SMPR2_SMP9_144_CYCLES               ( 6u << ADC_SMPR2_SMP9_Pos)
#define ADC_SMPR2_SMP9_480_CYCLES               ( 7u << ADC_SMPR2_SMP9_Pos)
#define ADC_SMPR1_SMP10_3_CYCLES                ( 0u << ADC_SMPR1_SMP10_Pos)
#define ADC_SMPR1_SMP10_15_CYCLES               ( 1u << ADC_SMPR1_SMP10_Pos)
#define ADC_SMPR1_SMP10_28_CYCLES               ( 2u << ADC_SMPR1_SMP10_Pos)
#define ADC_SMPR1_SMP10_56_CYCLES               ( 3u << ADC_SMPR1_SMP10_Pos)
#define ADC_SMPR1_SMP10_84_CYCLES               ( 4u << ADC_SMPR1_SMP10_Pos)
#define ADC_SMPR1_SMP10_112_CYCLES              ( 5u << ADC_SMPR1_SMP10_Pos)
#define ADC_SMPR1_SMP10_144_CYCLES              ( 6u << ADC_SMPR1_SMP10_Pos)
#define ADC_SMPR1_SMP10_480_CYCLES              ( 7u << ADC_SMPR1_SMP10_Pos)
#define ADC_SMPR1_SMP11_3_CYCLES                ( 0u << ADC_SMPR1_SMP11_Pos)
#define ADC_SMPR1_SMP11_15_CYCLES               ( 1u << ADC_SMPR1_SMP11_Pos)
#define ADC_SMPR1_SMP11_28_CYCLES               ( 2u << ADC_SMPR1_SMP11_Pos)
#define ADC_SMPR1_SMP11_56_CYCLES               ( 3u << ADC_SMPR1_SMP11_Pos)
#define ADC_SMPR1_SMP11_84_CYCLES               ( 4u << ADC_SMPR1_SMP11_Pos)
#define ADC_SMPR1_SMP11_112_CYCLES              ( 5u << ADC_SMPR1_SMP11_Pos)
#define ADC_SMPR1_SMP11_144_CYCLES              ( 6u << ADC_SMPR1_SMP11_Pos)
#define ADC_SMPR1_SMP11_480_CYCLES              ( 7u << ADC_SMPR1_SMP11_Pos)
#define ADC_SMPR1_SMP12_3_CYCLES                ( 0u << ADC_SMPR1_SMP12_Pos)
#define ADC_SMPR1_SMP12_15_CYCLES               ( 1u << ADC_SMPR1_SMP12_Pos)
#define ADC_SMPR1_SMP12_28_CYCLES               ( 2u << ADC_SMPR1_SMP12_Pos)
#define ADC_SMPR1_SMP12_56_CYCLES               ( 3u << ADC_SMPR1_SMP12_Pos)
#define ADC_SMPR1_SMP12_84_CYCLES               ( 4u << ADC_SMPR1_SMP12_Pos)
#define ADC_SMPR1_SMP12_112_CYCLES              ( 5u << ADC_SMPR1_SMP12_Pos)
#define ADC_SMPR1_SMP12_144_CYCLES              ( 6u << ADC_SMPR1_SMP12_Pos)
#define ADC_SMPR1_SMP12_480_CYCLES              ( 7u << ADC_SMPR1_SMP12_Pos)
#define ADC_SMPR1_SMP13_3_CYCLES                ( 0u << ADC_SMPR1_SMP13_Pos)
#define ADC_SMPR1_SMP13_15_CYCLES               ( 1u << ADC_SMPR1_SMP13_Pos)
#define ADC_SMPR1_SMP13_28_CYCLES               ( 2u << ADC_SMPR1_SMP13_Pos)
#define ADC_SMPR1_SMP13_56_CYCLES               ( 3u << ADC_SMPR1_SMP13_Pos)
#define ADC_SMPR1_SMP13_84_CYCLES               ( 4u << ADC_SMPR1_SMP13_Pos)
#define ADC_SMPR1_SMP13_112_CYCLES              ( 5u << ADC_SMPR1_SMP13_Pos)
#define ADC_SMPR1_SMP13_144_CYCLES              ( 6u << ADC_SMPR1_SMP13_Pos)
#define ADC_SMPR1_SMP13_480_CYCLES              ( 7u << ADC_SMPR1_SMP13_Pos)
#define ADC_SMPR1_SMP14_3_CYCLES                ( 0u << ADC_SMPR1_SMP14_Pos)
#define ADC_SMPR1_SMP14_15_CYCLES               ( 1u << ADC_SMPR1_SMP14_Pos)
#define ADC_SMPR1_SMP14_28_CYCLES               ( 2u << ADC_SMPR1_SMP14_Pos)
#define ADC_SMPR1_SMP14_56_CYCLES               ( 3u << ADC_SMPR1_SMP14_Pos)
#define ADC_SMPR1_SMP14_84_CYCLES               ( 4u << ADC_SMPR1_SMP14_Pos)
#define ADC_SMPR1_SMP14_112_CYCLES              ( 5u << ADC_SMPR1_SMP14_Pos)
#define ADC_SMPR1_SMP14_144_CYCLES              ( 6u << ADC_SMPR1_SMP14_Pos)
#define ADC_SMPR1_SMP14_480_CYCLES              ( 7u << ADC_SMPR1_SMP14_Pos)
#define ADC_SMPR1_SMP15_3_CYCLES                ( 0u << ADC_SMPR1_SMP15_Pos)
#define ADC_SMPR1_SMP15_15_CYCLES               ( 1u << ADC_SMPR1_SMP15_Pos)
#define ADC_SMPR1_SMP15_28_CYCLES               ( 2u << ADC_SMPR1_SMP15_Pos)
#define ADC_SMPR1_SMP15_56_CYCLES               ( 3u << ADC_SMPR1_SMP15_Pos)
#define ADC_SMPR1_SMP15_84_CYCLES               ( 4u << ADC_SMPR1_SMP15_Pos)
#define ADC_SMPR1_SMP15_112_CYCLES              ( 5u << ADC_SMPR1_SMP15_Pos)
#define ADC_SMPR1_SMP15_144_CYCLES              ( 6u << ADC_SMPR1_SMP15_Pos)
#define ADC_SMPR1_SMP15_480_CYCLES              ( 7u << ADC_SMPR1_SMP15_Pos)
#define ADC_SMPR1_SMP16_3_CYCLES                ( 0u << ADC_SMPR1_SMP16_Pos)
#define ADC_SMPR1_SMP16_15_CYCLES               ( 1u << ADC_SMPR1_SMP16_Pos)
#define ADC_SMPR1_SMP16_28_CYCLES               ( 2u << ADC_SMPR1_SMP16_Pos)
#define ADC_SMPR1_SMP16_56_CYCLES               ( 3u << ADC_SMPR1_SMP16_Pos)
#define ADC_SMPR1_SMP16_84_CYCLES               ( 4u << ADC_SMPR1_SMP16_Pos)
#define ADC_SMPR1_SMP16_112_CYCLES              ( 5u << ADC_SMPR1_SMP16_Pos)
#define ADC_SMPR1_SMP16_144_CYCLES              ( 6u << ADC_SMPR1_SMP16_Pos)
#define ADC_SMPR1_SMP16_480_CYCLES              ( 7u << ADC_SMPR1_SMP16_Pos)
#define ADC_SMPR1_SMP17_3_CYCLES                ( 0u << ADC_SMPR1_SMP17_Pos)
#define ADC_SMPR1_SMP17_15_CYCLES               ( 1u << ADC_SMPR1_SMP17_Pos)
#define ADC_SMPR1_SMP17_28_CYCLES               ( 2u << ADC_SMPR1_SMP17_Pos)
#define ADC_SMPR1_SMP17_56_CYCLES               ( 3u << ADC_SMPR1_SMP17_Pos)
#define ADC_SMPR1_SMP17_84_CYCLES               ( 4u << ADC_SMPR1_SMP17_Pos)
#define ADC_SMPR1_SMP17_112_CYCLES              ( 5u << ADC_SMPR1_SMP17_Pos)
#define ADC_SMPR1_SMP17_144_CYCLES              ( 6u << ADC_SMPR1_SMP17_Pos)
#define ADC_SMPR1_SMP17_480_CYCLES              ( 7u << ADC_SMPR1_SMP17_Pos)
#define ADC_SMPR1_SMP18_3_CYCLES                ( 0u << ADC_SMPR1_SMP18_Pos)
#define ADC_SMPR1_SMP18_15_CYCLES               ( 1u << ADC_SMPR1_SMP18_Pos)
#define ADC_SMPR1_SMP18_28_CYCLES               ( 2u << ADC_SMPR1_SMP18_Pos)
#define ADC_SMPR1_SMP18_56_CYCLES               ( 3u << ADC_SMPR1_SMP18_Pos)
#define ADC_SMPR1_SMP18_84_CYCLES               ( 4u << ADC_SMPR1_SMP18_Pos)
#define ADC_SMPR1_SMP18_112_CYCLES              ( 5u << ADC_SMPR1_SMP18_Pos)
#define ADC_SMPR1_SMP18_144_CYCLES              ( 6u << ADC_SMPR1_SMP18_Pos)
#define ADC_SMPR1_SMP18_480_CYCLES              ( 7u << ADC_SMPR1_SMP18_Pos)

