tcv-git/goodmicro/lib/goodmicro_stm32f4/stm32f4xx_missing.h
#define ADC_SQR3_SQ1_IN0                        ( 0u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN1                        ( 1u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN2                        ( 2u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN3                        ( 3u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN4                        ( 4u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN5                        ( 5u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN6                        ( 6u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN7                        ( 7u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN8                        ( 8u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN9                        ( 9u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN10                       (10u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN11                       (11u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN12                       (12u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN13                       (13u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN14                       (14u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN15                       (15u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN16                       (16u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN17                       (17u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ1_IN18                       (18u << ADC_SQR3_SQ1_Pos)
#define ADC_SQR3_SQ2_IN0                        ( 0u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN1                        ( 1u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN2                        ( 2u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN3                        ( 3u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN4                        ( 4u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN5                        ( 5u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN6                        ( 6u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN7                        ( 7u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN8                        ( 8u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN9                        ( 9u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN10                       (10u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN11                       (11u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN12                       (12u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN13                       (13u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN14                       (14u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN15                       (15u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN16                       (16u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN17                       (17u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ2_IN18                       (18u << ADC_SQR3_SQ2_Pos)
#define ADC_SQR3_SQ3_IN0                        ( 0u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN1                        ( 1u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN2                        ( 2u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN3                        ( 3u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN4                        ( 4u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN5                        ( 5u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN6                        ( 6u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN7                        ( 7u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN8                        ( 8u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN9                        ( 9u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN10                       (10u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN11                       (11u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN12                       (12u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN13                       (13u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN14                       (14u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN15                       (15u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN16                       (16u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN17                       (17u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ3_IN18                       (18u << ADC_SQR3_SQ3_Pos)
#define ADC_SQR3_SQ4_IN0                        ( 0u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN1                        ( 1u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN2                        ( 2u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN3                        ( 3u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN4                        ( 4u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN5                        ( 5u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN6                        ( 6u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN7                        ( 7u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN8                        ( 8u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN9                        ( 9u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN10                       (10u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN11                       (11u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN12                       (12u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN13                       (13u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN14                       (14u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN15                       (15u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN16                       (16u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN17                       (17u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ4_IN18                       (18u << ADC_SQR3_SQ4_Pos)
#define ADC_SQR3_SQ5_IN0                        ( 0u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN1                        ( 1u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN2                        ( 2u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN3                        ( 3u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN4                        ( 4u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN5                        ( 5u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN6                        ( 6u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN7                        ( 7u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN8                        ( 8u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN9                        ( 9u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN10                       (10u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN11                       (11u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN12                       (12u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN13                       (13u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN14                       (14u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN15                       (15u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN16                       (16u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN17                       (17u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ5_IN18                       (18u << ADC_SQR3_SQ5_Pos)
#define ADC_SQR3_SQ6_IN0                        ( 0u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN1                        ( 1u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN2                        ( 2u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN3                        ( 3u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN4                        ( 4u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN5                        ( 5u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN6                        ( 6u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN7                        ( 7u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN8                        ( 8u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN9                        ( 9u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN10                       (10u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN11                       (11u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN12                       (12u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN13                       (13u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN14                       (14u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN15                       (15u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN16                       (16u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN17                       (17u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR3_SQ6_IN18                       (18u << ADC_SQR3_SQ6_Pos)
#define ADC_SQR2_SQ7_IN0                        ( 0u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN1                        ( 1u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN2                        ( 2u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN3                        ( 3u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN4                        ( 4u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN5                        ( 5u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN6                        ( 6u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN7                        ( 7u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN8                        ( 8u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN9                        ( 9u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN10                       (10u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN11                       (11u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN12                       (12u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN13                       (13u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN14                       (14u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN15                       (15u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN16                       (16u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN17                       (17u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ7_IN18                       (18u << ADC_SQR2_SQ7_Pos)
#define ADC_SQR2_SQ8_IN0                        ( 0u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN1                        ( 1u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN2                        ( 2u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN3                        ( 3u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN4                        ( 4u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN5                        ( 5u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN6                        ( 6u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN7                        ( 7u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN8                        ( 8u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN9                        ( 9u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN10                       (10u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN11                       (11u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN12                       (12u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN13                       (13u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN14                       (14u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN15                       (15u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN16                       (16u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN17                       (17u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ8_IN18                       (18u << ADC_SQR2_SQ8_Pos)
#define ADC_SQR2_SQ9_IN0                        ( 0u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN1                        ( 1u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN2                        ( 2u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN3                        ( 3u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN4                        ( 4u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN5                        ( 5u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN6                        ( 6u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN7                        ( 7u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN8                        ( 8u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN9                        ( 9u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN10                       (10u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN11                       (11u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN12                       (12u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN13                       (13u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN14                       (14u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN15                       (15u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN16                       (16u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN17                       (17u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ9_IN18                       (18u << ADC_SQR2_SQ9_Pos)
#define ADC_SQR2_SQ10_IN0                       ( 0u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN1                       ( 1u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN2                       ( 2u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN3                       ( 3u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN4                       ( 4u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN5                       ( 5u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN6                       ( 6u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN7                       ( 7u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN8                       ( 8u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN9                       ( 9u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN10                      (10u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN11                      (11u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN12                      (12u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN13                      (13u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN14                      (14u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN15                      (15u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN16                      (16u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN17                      (17u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ10_IN18                      (18u << ADC_SQR2_SQ10_Pos)
#define ADC_SQR2_SQ11_IN0                       ( 0u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN1                       ( 1u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN2                       ( 2u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN3                       ( 3u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN4                       ( 4u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN5                       ( 5u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN6                       ( 6u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN7                       ( 7u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN8                       ( 8u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN9                       ( 9u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN10                      (10u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN11                      (11u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN12                      (12u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN13                      (13u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN14                      (14u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN15                      (15u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN16                      (16u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN17                      (17u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ11_IN18                      (18u << ADC_SQR2_SQ11_Pos)
#define ADC_SQR2_SQ12_IN0                       ( 0u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN1                       ( 1u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN2                       ( 2u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN3                       ( 3u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN4                       ( 4u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN5                       ( 5u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN6                       ( 6u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN7                       ( 7u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN8                       ( 8u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN9                       ( 9u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN10                      (10u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN11                      (11u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN12                      (12u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN13                      (13u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN14                      (14u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN15                      (15u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN16                      (16u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN17                      (17u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR2_SQ12_IN18                      (18u << ADC_SQR2_SQ12_Pos)
#define ADC_SQR1_SQ13_IN0                       ( 0u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN1                       ( 1u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN2                       ( 2u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN3                       ( 3u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN4                       ( 4u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN5                       ( 5u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN6                       ( 6u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN7                       ( 7u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN8                       ( 8u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN9                       ( 9u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN10                      (10u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN11                      (11u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN12                      (12u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN13                      (13u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN14                      (14u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN15                      (15u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN16                      (16u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN17                      (17u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ13_IN18                      (18u << ADC_SQR1_SQ13_Pos)
#define ADC_SQR1_SQ14_IN0                       ( 0u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN1                       ( 1u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN2                       ( 2u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN3                       ( 3u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN4                       ( 4u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN5                       ( 5u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN6                       ( 6u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN7                       ( 7u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN8                       ( 8u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN9                       ( 9u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN10                      (10u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN11                      (11u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN12                      (12u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN13                      (13u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN14                      (14u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN15                      (15u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN16                      (16u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN17                      (17u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ14_IN18                      (18u << ADC_SQR1_SQ14_Pos)
#define ADC_SQR1_SQ15_IN0                       ( 0u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN1                       ( 1u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN2                       ( 2u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN3                       ( 3u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN4                       ( 4u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN5                       ( 5u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN6                       ( 6u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN7                       ( 7u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN8                       ( 8u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN9                       ( 9u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN10                      (10u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN11                      (11u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN12                      (12u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN13                      (13u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN14                      (14u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN15                      (15u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN16                      (16u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN17                      (17u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ15_IN18                      (18u << ADC_SQR1_SQ15_Pos)
#define ADC_SQR1_SQ16_IN0                       ( 0u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN1                       ( 1u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN2                       ( 2u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN3                       ( 3u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN4                       ( 4u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN5                       ( 5u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN6                       ( 6u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN7                       ( 7u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN8                       ( 8u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN9                       ( 9u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN10                      (10u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN11                      (11u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN12                      (12u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN13                      (13u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN14                      (14u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN15                      (15u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN16                      (16u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN17                      (17u << ADC_SQR1_SQ16_Pos)
#define ADC_SQR1_SQ16_IN18                      (18u << ADC_SQR1_SQ16_Pos)

#define ADC_SQR1_L_1_CONVERSION                 ( 0u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_2_CONVERSIONS                ( 1u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_3_CONVERSIONS                ( 2u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_4_CONVERSIONS                ( 3u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_5_CONVERSIONS                ( 4u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_6_CONVERSIONS                ( 5u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_7_CONVERSIONS                ( 6u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_8_CONVERSIONS                ( 7u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_9_CONVERSIONS                ( 8u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_10_CONVERSIONS               ( 9u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_11_CONVERSIONS               (10u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_12_CONVERSIONS               (11u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_13_CONVERSIONS               (12u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_14_CONVERSIONS               (13u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_15_CONVERSIONS               (14u << ADC_SQR1_L_Pos)
#define ADC_SQR1_L_16_CONVERSIONS               (15u << ADC_SQR1_L_Pos)

