tcv-git/goodmicro/lib/goodmicro_stm32f4/stm32f4xx_missing.h
#define ADC_JSQR_JSQ1_IN0                       ( 0u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN1                       ( 1u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN2                       ( 2u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN3                       ( 3u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN4                       ( 4u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN5                       ( 5u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN6                       ( 6u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN7                       ( 7u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN8                       ( 8u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN9                       ( 9u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN10                      (10u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN11                      (11u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN12                      (12u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN13                      (13u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN14                      (14u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN15                      (15u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN16                      (16u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN17                      (17u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ1_IN18                      (18u << ADC_JSQR_JSQ1_Pos)
#define ADC_JSQR_JSQ2_IN0                       ( 0u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN1                       ( 1u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN2                       ( 2u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN3                       ( 3u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN4                       ( 4u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN5                       ( 5u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN6                       ( 6u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN7                       ( 7u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN8                       ( 8u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN9                       ( 9u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN10                      (10u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN11                      (11u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN12                      (12u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN13                      (13u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN14                      (14u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN15                      (15u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN16                      (16u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN17                      (17u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ2_IN18                      (18u << ADC_JSQR_JSQ2_Pos)
#define ADC_JSQR_JSQ3_IN0                       ( 0u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN1                       ( 1u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN2                       ( 2u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN3                       ( 3u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN4                       ( 4u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN5                       ( 5u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN6                       ( 6u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN7                       ( 7u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN8                       ( 8u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN9                       ( 9u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN10                      (10u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN11                      (11u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN12                      (12u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN13                      (13u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN14                      (14u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN15                      (15u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN16                      (16u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN17                      (17u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ3_IN18                      (18u << ADC_JSQR_JSQ3_Pos)
#define ADC_JSQR_JSQ4_IN0                       ( 0u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN1                       ( 1u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN2                       ( 2u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN3                       ( 3u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN4                       ( 4u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN5                       ( 5u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN6                       ( 6u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN7                       ( 7u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN8                       ( 8u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN9                       ( 9u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN10                      (10u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN11                      (11u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN12                      (12u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN13                      (13u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN14                      (14u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN15                      (15u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN16                      (16u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN17                      (17u << ADC_JSQR_JSQ4_Pos)
#define ADC_JSQR_JSQ4_IN18                      (18u << ADC_JSQR_JSQ4_Pos)

#define ADC_JSQR_JL_1_CONVERSION                ( 0u << ADC_JSQR_JL_Pos)
#define ADC_JSQR_JL_2_CONVERSIONS               ( 1u << ADC_JSQR_JL_Pos)
#define ADC_JSQR_JL_3_CONVERSIONS               ( 2u << ADC_JSQR_JL_Pos)
#define ADC_JSQR_JL_4_CONVERSIONS               ( 3u << ADC_JSQR_JL_Pos)

#ifdef __cplusplus
}
#endif

#endif // STM32F4XX_MISSING_H_INCLUDED
